Revit 2024 API
SpotDimension.Flip Method
 Flips dimension to the other side of the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.2
Syntax
C#
public void Flip()
Visual Basic
Public Sub Flip
Visual C++
public:
void Flip()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  SpotDimension cannot be flipped.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace